import random

# 民族的名称和对应的比例。比例大致按照人口比例进行设置
ethnic_ratios = {
    "汉族": 91.1, "壮族": 1.3, "回族": 0.8, "满族": 0.8, "维吾尔族": 0.7, "苗族": 0.7,
    "土家族": 0.6, "彝族": 0.6, "蒙古族": 0.4, "藏族": 0.4, "布依族": 0.2, "侗族": 0.2,
    "瑶族": 0.2, "白族": 0.1, "朝鲜族": 0.1, "哈尼族": 0.1, "黎族": 0.1, "哈萨克族": 0.1,
    "傣族": 0.1, "畲族": 0.07, "傈僳族": 0.06, "仡佬族": 0.06, "东乡族": 0.05, "高山族": 0.05,
    "拉祜族": 0.04, "水族": 0.04, "佤族": 0.04, "纳西族": 0.04, "羌族": 0.04, "土族": 0.03,
    "仫佬族": 0.03, "锡伯族": 0.03, "柯尔克孜族": 0.02, "达斡尔族": 0.02, "景颇族": 0.02,
    "毛南族": 0.02, "撒拉族": 0.02, "布朗族": 0.02, "塔吉克族": 0.01, "阿昌族": 0.01,
    "普米族": 0.01, "鄂温克族": 0.01, "怒族": 0.01, "京族": 0.01, "基诺族": 0.01,
    "德昂族": 0.01, "保安族": 0.01, "俄罗斯族": 0.01, "裕固族": 0.01, "乌孜别克族": 0.01,
    "门巴族": 0.01, "鄂伦春族": 0.01, "独龙族": 0.01, "赫哲族": 0.01, "珞巴族": 0.01
}

def generate_ethnic_sample(n: int) -> list[str]:
    """
    按照人口比例批量生成民族列表

    Args:
        n: int, 生成的数量

    Returns:
        list[str]: 生成的民族列表
    """
    names = list(ethnic_ratios.keys())
    weights = list(ethnic_ratios.values())

    return random.choices(names, weights=weights, k=n)

